//
// Created by jhchen<jianhuchen@163.com> on 2019-11-12 15:03:34.
//
// 题目链接: https://pintia.cn/problem-sets/994805260223102976/problems/994805313708867584
// 题目描述: 设计函数求一元多项式的导数。（注：$$x^n$$（$$n$$为整数）的一阶导数为$$n x^{n-1}$$。）
//
// ### 输入格式:
//
// 以指数递降方式输入多项式非零项系数和指数（绝对值均为不超过 1000 的整数）。数字间以空格分隔。
//
// ### 输出格式:
//
// 以与输入相同的格式输出导数多项式非零项的系数和指数。数字间以空格分隔，但结尾不能有多余空格。注意“零多项式”的指数和系数都是 0，但是表示为 `0 0`。
//
// ### 输入样例:
// ```in
// 3 4 -5 2 6 1 -2 0
// ```
//
// ### 输出样例:
// ```out
// 12 3 -10 1 6 0
//
#include <iostream>

using namespace std;

int main() {
    int m, n;
    cin >> m >> n;
    if (n == 0) {
        cout << "0 0";
    } else {
        cout << m * n << " " << n - 1;
    }
    while (cin >> m >> n) {
        if (n != 0) {
            cout << " " << m * n << " " << n - 1;
        }
    }
    return 0;
}
